In [1]:
import pandas as pd

In [2]:
mydict = {
    
    'name' : ['arfa','saad','rafay','zunair','numair'],
    'age' : [22.5,21,21,19,19],
    'matric_marks' : [500, 1000, 1020, 1005, 1030],
    'city' : ['Rawalpindi','Rawalpindi','Rawalpindi','Lahore','Lahore'],
}

In [3]:
my_dataframe = pd.DataFrame(mydict)

In [4]:
my_dataframe

     name   age  matric_marks        city
0    arfa  22.5           500  Rawalpindi
1    saad  21.0          1000  Rawalpindi
2   rafay  21.0          1020  Rawalpindi
3  zunair  19.0          1005      Lahore
4  numair  19.0          1030      Lahore

In [5]:
##We can export it to csv format as

In [6]:
##We need to pass a file name as parameter to .to_csv()
my_dataframe.to_csv('mydataframe.csv')

In [7]:
##If we don't want indexe numbers in the resultant excel sheet we can do this
my_dataframe.to_csv('mydataframe_withoutindex.csv',index=False)

In [8]:
##If you have a dataframe, and you want to get the top most rows
my_dataframe.head(3)
##pass the number of rows as a parameter

    name   age  matric_marks        city
0   arfa  22.5           500  Rawalpindi
1   saad  21.0          1000  Rawalpindi
2  rafay  21.0          1020  Rawalpindi

In [9]:
##Similarly if you want to get the ending rows of some dataframe
my_dataframe.tail(2)

     name   age  matric_marks    city
3  zunair  19.0          1005  Lahore
4  numair  19.0          1030  Lahore

In [11]:
##if we want some statistical observation of data we can use describe()
my_dataframe.describe()

        age  matric_marks
count   5.0      5.000000
mean   20.5    911.000000
std     1.5    230.065208
min    19.0    500.000000
25%    19.0   1000.000000
50%    21.0   1005.000000
75%    21.0   1020.000000
max    22.5   1030.000000

In [18]:
##we can work with already existing csv files by using read_csv()
my_dataframe2 = pd.read_csv('mydata.csv')

In [19]:
my_dataframe2

         City  Distance_km  Time_hr
0  Rawalpindi            5      0.2
1      Lahore          373      5.0
2  Faisalabad          340      4.5
3       Jhang          400      5.5
4      Multan          700      7.0

In [20]:
my_dataframe2.describe()

       Distance_km   Time_hr
count     5.000000  5.000000
mean    363.600000  4.440000
std     246.844688  2.548137
min       5.000000  0.200000
25%     340.000000  4.500000
50%     373.000000  5.000000
75%     400.000000  5.500000
max     700.000000  7.000000

In [30]:
##we can get the value of a column by using its key and index
my_dataframe2['Time_hr'][1]

5.0

In [32]:
##similarly we can change value of a key at some index
my_dataframe2['Distance_km'][0]=6

C:\Users\arfas\AppData\Local\Temp/ipykernel_12540/1312235534.py:2: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  my_dataframe2['Distance_km'][0]=6

In [33]:
my_dataframe2

         City  Distance_km  Time_hr
0  Rawalpindi            6      0.2
1      Lahore          373      5.0
2  Faisalabad          340      4.5
3       Jhang          400      5.5
4      Multan          700      7.0

In [41]:
##we can rename the index values using .index and attribute values using .column
my_dataframe2.index = ['zero','one','two','three','four']
my_dataframe2.column = ['cityyyy','distancekkmm','timehr']

In [42]:
my_dataframe2

             City  Distance_km  Time_hr
zero   Rawalpindi            6      0.2
one        Lahore          373      5.0
two    Faisalabad          340      4.5
three       Jhang          400      5.5
four       Multan          700      7.0